zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4lc4b.h
#define PINMUX_PA07B_USART0_TXD    ((PIN_PA07B_USART0_TXD << 16) | MUX_PA07B_USART0_TXD)
#define GPIO_PA07B_USART0_TXD    _UL(1 <<  7)
#define PIN_PB01B_USART0_TXD           _L(33) /**< \brief USART0 signal: TXD on PB01 mux B */
#define MUX_PB01B_USART0_TXD            _L(1)
#define PINMUX_PB01B_USART0_TXD    ((PIN_PB01B_USART0_TXD << 16) | MUX_PB01B_USART0_TXD)
#define GPIO_PB01B_USART0_TXD    _UL(1 <<  1)
#define PIN_PA12A_USART0_TXD           _L(12) /**< \brief USART0 signal: TXD on PA12 mux A */
#define MUX_PA12A_USART0_TXD            _L(0)
#define PINMUX_PA12A_USART0_TXD    ((PIN_PA12A_USART0_TXD << 16) | MUX_PA12A_USART0_TXD)
#define GPIO_PA12A_USART0_TXD    _UL(1 << 12)
#define PIN_PB15A_USART0_TXD           _L(47) /**< \brief USART0 signal: TXD on PB15 mux A */
#define MUX_PB15A_USART0_TXD            _L(0)
#define PINMUX_PB15A_USART0_TXD    ((PIN_PB15A_USART0_TXD << 16) | MUX_PB15A_USART0_TXD)
#define GPIO_PB15A_USART0_TXD    _UL(1 << 15)
/* ========== GPIO definition for USART1 peripheral ========== */
#define PIN_PB03B_USART1_CLK           _L(35) /**< \brief USART1 signal: CLK on PB03 mux B */
#define MUX_PB03B_USART1_CLK            _L(1)
#define PINMUX_PB03B_USART1_CLK    ((PIN_PB03B_USART1_CLK << 16) | MUX_PB03B_USART1_CLK)
#define GPIO_PB03B_USART1_CLK    _UL(1 <<  3)
#define PIN_PA14A_USART1_CLK           _L(14) /**< \brief USART1 signal: CLK on PA14 mux A */
#define MUX_PA14A_USART1_CLK            _L(0)
#define PINMUX_PA14A_USART1_CLK    ((PIN_PA14A_USART1_CLK << 16) | MUX_PA14A_USART1_CLK)
#define GPIO_PA14A_USART1_CLK    _UL(1 << 14)
#define PIN_PA21B_USART1_CTS           _L(21) /**< \brief USART1 signal: CTS on PA21 mux B */
#define MUX_PA21B_USART1_CTS            _L(1)
#define PINMUX_PA21B_USART1_CTS    ((PIN_PA21B_USART1_CTS << 16) | MUX_PA21B_USART1_CTS)
#define GPIO_PA21B_USART1_CTS    _UL(1 << 21)
#define PIN_PB02B_USART1_RTS           _L(34) /**< \brief USART1 signal: RTS on PB02 mux B */
#define MUX_PB02B_USART1_RTS            _L(1)
#define PINMUX_PB02B_USART1_RTS    ((PIN_PB02B_USART1_RTS << 16) | MUX_PB02B_USART1_RTS)
#define GPIO_PB02B_USART1_RTS    _UL(1 <<  2)
#define PIN_PA13A_USART1_RTS           _L(13) /**< \brief USART1 signal: RTS on PA13 mux A */
#define MUX_PA13A_USART1_RTS            _L(0)
#define PINMUX_PA13A_USART1_RTS    ((PIN_PA13A_USART1_RTS << 16) | MUX_PA13A_USART1_RTS)
#define GPIO_PA13A_USART1_RTS    _UL(1 << 13)
#define PIN_PB04B_USART1_RXD           _L(36) /**< \brief USART1 signal: RXD on PB04 mux B */
#define MUX_PB04B_USART1_RXD            _L(1)
#define PINMUX_PB04B_USART1_RXD    ((PIN_PB04B_USART1_RXD << 16) | MUX_PB04B_USART1_RXD)
#define GPIO_PB04B_USART1_RXD    _UL(1 <<  4)
#define PIN_PA15A_USART1_RXD           _L(15) /**< \brief USART1 signal: RXD on PA15 mux A */
#define MUX_PA15A_USART1_RXD            _L(0)
#define PINMUX_PA15A_USART1_RXD    ((PIN_PA15A_USART1_RXD << 16) | MUX_PA15A_USART1_RXD)
#define GPIO_PA15A_USART1_RXD    _UL(1 << 15)
#define PIN_PB05B_USART1_TXD           _L(37) /**< \brief USART1 signal: TXD on PB05 mux B */
#define MUX_PB05B_USART1_TXD            _L(1)
#define PINMUX_PB05B_USART1_TXD    ((PIN_PB05B_USART1_TXD << 16) | MUX_PB05B_USART1_TXD)
#define GPIO_PB05B_USART1_TXD    _UL(1 <<  5)
#define PIN_PA16A_USART1_TXD           _L(16) /**< \brief USART1 signal: TXD on PA16 mux A */
#define MUX_PA16A_USART1_TXD            _L(0)
#define PINMUX_PA16A_USART1_TXD    ((PIN_PA16A_USART1_TXD << 16) | MUX_PA16A_USART1_TXD)
#define GPIO_PA16A_USART1_TXD    _UL(1 << 16)
/* ========== GPIO definition for USART2 peripheral ========== */
#define PIN_PA18A_USART2_CLK           _L(18) /**< \brief USART2 signal: CLK on PA18 mux A */
#define MUX_PA18A_USART2_CLK            _L(0)
#define PINMUX_PA18A_USART2_CLK    ((PIN_PA18A_USART2_CLK << 16) | MUX_PA18A_USART2_CLK)
#define GPIO_PA18A_USART2_CLK    _UL(1 << 18)
#define PIN_PA22B_USART2_CTS           _L(22) /**< \brief USART2 signal: CTS on PA22 mux B */
#define MUX_PA22B_USART2_CTS            _L(1)
#define PINMUX_PA22B_USART2_CTS    ((PIN_PA22B_USART2_CTS << 16) | MUX_PA22B_USART2_CTS)
#define GPIO_PA22B_USART2_CTS    _UL(1 << 22)
#define PIN_PA17A_USART2_RTS           _L(17) /**< \brief USART2 signal: RTS on PA17 mux A */
#define MUX_PA17A_USART2_RTS            _L(0)
#define PINMUX_PA17A_USART2_RTS    ((PIN_PA17A_USART2_RTS << 16) | MUX_PA17A_USART2_RTS)
#define GPIO_PA17A_USART2_RTS    _UL(1 << 17)
#define PIN_PA25B_USART2_RXD           _L(25) /**< \brief USART2 signal: RXD on PA25 mux B */
#define MUX_PA25B_USART2_RXD            _L(1)
#define PINMUX_PA25B_USART2_RXD    ((PIN_PA25B_USART2_RXD << 16) | MUX_PA25B_USART2_RXD)
#define GPIO_PA25B_USART2_RXD    _UL(1 << 25)
#define PIN_PA19A_USART2_RXD           _L(19) /**< \brief USART2 signal: RXD on PA19 mux A */
#define MUX_PA19A_USART2_RXD            _L(0)
#define PINMUX_PA19A_USART2_RXD    ((PIN_PA19A_USART2_RXD << 16) | MUX_PA19A_USART2_RXD)
#define GPIO_PA19A_USART2_RXD    _UL(1 << 19)
#define PIN_PA26B_USART2_TXD           _L(26) /**< \brief USART2 signal: TXD on PA26 mux B */
#define MUX_PA26B_USART2_TXD            _L(1)
#define PINMUX_PA26B_USART2_TXD    ((PIN_PA26B_USART2_TXD << 16) | MUX_PA26B_USART2_TXD)
#define GPIO_PA26B_USART2_TXD    _UL(1 << 26)
#define PIN_PA20A_USART2_TXD           _L(20) /**< \brief USART2 signal: TXD on PA20 mux A */
#define MUX_PA20A_USART2_TXD            _L(0)
#define PINMUX_PA20A_USART2_TXD    ((PIN_PA20A_USART2_TXD << 16) | MUX_PA20A_USART2_TXD)
#define GPIO_PA20A_USART2_TXD    _UL(1 << 20)
/* ========== GPIO definition for USART3 peripheral ========== */
#define PIN_PB08A_USART3_CLK           _L(40) /**< \brief USART3 signal: CLK on PB08 mux A */
#define MUX_PB08A_USART3_CLK            _L(0)
#define PINMUX_PB08A_USART3_CLK    ((PIN_PB08A_USART3_CLK << 16) | MUX_PB08A_USART3_CLK)
#define GPIO_PB08A_USART3_CLK    _UL(1 <<  8)
#define PIN_PB07A_USART3_CTS           _L(39) /**< \brief USART3 signal: CTS on PB07 mux A */
#define MUX_PB07A_USART3_CTS            _L(0)
#define PINMUX_PB07A_USART3_CTS    ((PIN_PB07A_USART3_CTS << 16) | MUX_PB07A_USART3_CTS)
#define GPIO_PB07A_USART3_CTS    _UL(1 <<  7)
#define PIN_PB06A_USART3_RTS           _L(38) /**< \brief USART3 signal: RTS on PB06 mux A */
#define MUX_PB06A_USART3_RTS            _L(0)
#define PINMUX_PB06A_USART3_RTS    ((PIN_PB06A_USART3_RTS << 16) | MUX_PB06A_USART3_RTS)
#define GPIO_PB06A_USART3_RTS    _UL(1 <<  6)
#define PIN_PB09A_USART3_RXD           _L(41) /**< \brief USART3 signal: RXD on PB09 mux A */
#define MUX_PB09A_USART3_RXD            _L(0)
#define PINMUX_PB09A_USART3_RXD    ((PIN_PB09A_USART3_RXD << 16) | MUX_PB09A_USART3_RXD)
#define GPIO_PB09A_USART3_RXD    _UL(1 <<  9)
#define PIN_PB10A_USART3_TXD           _L(42) /**< \brief USART3 signal: TXD on PB10 mux A */
#define MUX_PB10A_USART3_TXD            _L(0)
#define PINMUX_PB10A_USART3_TXD    ((PIN_PB10A_USART3_TXD << 16) | MUX_PB10A_USART3_TXD)
#define GPIO_PB10A_USART3_TXD    _UL(1 << 10)
/* ========== GPIO definition for ADCIFE peripheral ========== */
#define PIN_PA04A_ADCIFE_AD0            _L(4) /**< \brief ADCIFE signal: AD0 on PA04 mux A */
#define MUX_PA04A_ADCIFE_AD0            _L(0)
#define PINMUX_PA04A_ADCIFE_AD0    ((PIN_PA04A_ADCIFE_AD0 << 16) | MUX_PA04A_ADCIFE_AD0)
#define GPIO_PA04A_ADCIFE_AD0    _UL(1 <<  4)
#define PIN_PA05A_ADCIFE_AD1            _L(5) /**< \brief ADCIFE signal: AD1 on PA05 mux A */
#define MUX_PA05A_ADCIFE_AD1            _L(0)
#define PINMUX_PA05A_ADCIFE_AD1    ((PIN_PA05A_ADCIFE_AD1 << 16) | MUX_PA05A_ADCIFE_AD1)
#define GPIO_PA05A_ADCIFE_AD1    _UL(1 <<  5)
#define PIN_PA07A_ADCIFE_AD2            _L(7) /**< \brief ADCIFE signal: AD2 on PA07 mux A */
#define MUX_PA07A_ADCIFE_AD2            _L(0)
#define PINMUX_PA07A_ADCIFE_AD2    ((PIN_PA07A_ADCIFE_AD2 << 16) | MUX_PA07A_ADCIFE_AD2)
#define GPIO_PA07A_ADCIFE_AD2    _UL(1 <<  7)
#define PIN_PB02A_ADCIFE_AD3           _L(34) /**< \brief ADCIFE signal: AD3 on PB02 mux A */
#define MUX_PB02A_ADCIFE_AD3            _L(0)
#define PINMUX_PB02A_ADCIFE_AD3    ((PIN_PB02A_ADCIFE_AD3 << 16) | MUX_PB02A_ADCIFE_AD3)
#define GPIO_PB02A_ADCIFE_AD3    _UL(1 <<  2)
#define PIN_PB03A_ADCIFE_AD4           _L(35) /**< \brief ADCIFE signal: AD4 on PB03 mux A */
#define MUX_PB03A_ADCIFE_AD4            _L(0)
#define PINMUX_PB03A_ADCIFE_AD4    ((PIN_PB03A_ADCIFE_AD4 << 16) | MUX_PB03A_ADCIFE_AD4)
#define GPIO_PB03A_ADCIFE_AD4    _UL(1 <<  3)
#define PIN_PB04A_ADCIFE_AD5           _L(36) /**< \brief ADCIFE signal: AD5 on PB04 mux A */
#define MUX_PB04A_ADCIFE_AD5            _L(0)
#define PINMUX_PB04A_ADCIFE_AD5    ((PIN_PB04A_ADCIFE_AD5 << 16) | MUX_PB04A_ADCIFE_AD5)
#define GPIO_PB04A_ADCIFE_AD5    _UL(1 <<  4)
#define PIN_PB05A_ADCIFE_AD6           _L(37) /**< \brief ADCIFE signal: AD6 on PB05 mux A */
#define MUX_PB05A_ADCIFE_AD6            _L(0)
#define PINMUX_PB05A_ADCIFE_AD6    ((PIN_PB05A_ADCIFE_AD6 << 16) | MUX_PB05A_ADCIFE_AD6)
#define GPIO_PB05A_ADCIFE_AD6    _UL(1 <<  5)
#define PIN_PA05E_ADCIFE_TRIGGER        _L(5) /**< \brief ADCIFE signal: TRIGGER on PA05 mux E */
#define MUX_PA05E_ADCIFE_TRIGGER        _L(4)
#define PINMUX_PA05E_ADCIFE_TRIGGER  ((PIN_PA05E_ADCIFE_TRIGGER << 16) | MUX_PA05E_ADCIFE_TRIGGER)
#define GPIO_PA05E_ADCIFE_TRIGGER  _UL(1 <<  5)
/* ========== GPIO definition for DACC peripheral ========== */
#define PIN_PB04E_DACC_EXT_TRIG0       _L(36) /**< \brief DACC signal: EXT_TRIG0 on PB04 mux E */
#define MUX_PB04E_DACC_EXT_TRIG0        _L(4)
#define PINMUX_PB04E_DACC_EXT_TRIG0  ((PIN_PB04E_DACC_EXT_TRIG0 << 16) | MUX_PB04E_DACC_EXT_TRIG0)
#define GPIO_PB04E_DACC_EXT_TRIG0  _UL(1 <<  4)
#define PIN_PA06A_DACC_VOUT             _L(6) /**< \brief DACC signal: VOUT on PA06 mux A */
#define MUX_PA06A_DACC_VOUT             _L(0)
#define PINMUX_PA06A_DACC_VOUT     ((PIN_PA06A_DACC_VOUT << 16) | MUX_PA06A_DACC_VOUT)
#define GPIO_PA06A_DACC_VOUT     _UL(1 <<  6)
/* ========== GPIO definition for ACIFC peripheral ========== */
#define PIN_PA06E_ACIFC_ACAN0           _L(6) /**< \brief ACIFC signal: ACAN0 on PA06 mux E */
#define MUX_PA06E_ACIFC_ACAN0           _L(4)
#define PINMUX_PA06E_ACIFC_ACAN0   ((PIN_PA06E_ACIFC_ACAN0 << 16) | MUX_PA06E_ACIFC_ACAN0)
#define GPIO_PA06E_ACIFC_ACAN0   _UL(1 <<  6)
#define PIN_PA07E_ACIFC_ACAP0           _L(7) /**< \brief ACIFC signal: ACAP0 on PA07 mux E */
#define MUX_PA07E_ACIFC_ACAP0           _L(4)
#define PINMUX_PA07E_ACIFC_ACAP0   ((PIN_PA07E_ACIFC_ACAP0 << 16) | MUX_PA07E_ACIFC_ACAP0)
#define GPIO_PA07E_ACIFC_ACAP0   _UL(1 <<  7)
#define PIN_PB02E_ACIFC_ACBN0          _L(34) /**< \brief ACIFC signal: ACBN0 on PB02 mux E */
#define MUX_PB02E_ACIFC_ACBN0           _L(4)
#define PINMUX_PB02E_ACIFC_ACBN0   ((PIN_PB02E_ACIFC_ACBN0 << 16) | MUX_PB02E_ACIFC_ACBN0)
#define GPIO_PB02E_ACIFC_ACBN0   _UL(1 <<  2)
#define PIN_PB03E_ACIFC_ACBP0          _L(35) /**< \brief ACIFC signal: ACBP0 on PB03 mux E */
#define MUX_PB03E_ACIFC_ACBP0           _L(4)
#define PINMUX_PB03E_ACIFC_ACBP0   ((PIN_PB03E_ACIFC_ACBP0 << 16) | MUX_PB03E_ACIFC_ACBP0)
#define GPIO_PB03E_ACIFC_ACBP0   _UL(1 <<  3)
/* ========== GPIO definition for GLOC peripheral ========== */
#define PIN_PA06D_GLOC_IN0              _L(6) /**< \brief GLOC signal: IN0 on PA06 mux D */
#define MUX_PA06D_GLOC_IN0              _L(3)
#define PINMUX_PA06D_GLOC_IN0      ((PIN_PA06D_GLOC_IN0 << 16) | MUX_PA06D_GLOC_IN0)
#define GPIO_PA06D_GLOC_IN0      _UL(1 <<  6)
#define PIN_PA20D_GLOC_IN0             _L(20) /**< \brief GLOC signal: IN0 on PA20 mux D */
#define MUX_PA20D_GLOC_IN0              _L(3)
#define PINMUX_PA20D_GLOC_IN0      ((PIN_PA20D_GLOC_IN0 << 16) | MUX_PA20D_GLOC_IN0)
#define GPIO_PA20D_GLOC_IN0      _UL(1 << 20)
#define PIN_PA04D_GLOC_IN1              _L(4) /**< \brief GLOC signal: IN1 on PA04 mux D */
#define MUX_PA04D_GLOC_IN1              _L(3)
#define PINMUX_PA04D_GLOC_IN1      ((PIN_PA04D_GLOC_IN1 << 16) | MUX_PA04D_GLOC_IN1)
#define GPIO_PA04D_GLOC_IN1      _UL(1 <<  4)
#define PIN_PA21D_GLOC_IN1             _L(21) /**< \brief GLOC signal: IN1 on PA21 mux D */
#define MUX_PA21D_GLOC_IN1              _L(3)
#define PINMUX_PA21D_GLOC_IN1      ((PIN_PA21D_GLOC_IN1 << 16) | MUX_PA21D_GLOC_IN1)
#define GPIO_PA21D_GLOC_IN1      _UL(1 << 21)
#define PIN_PA05D_GLOC_IN2              _L(5) /**< \brief GLOC signal: IN2 on PA05 mux D */
#define MUX_PA05D_GLOC_IN2              _L(3)
#define PINMUX_PA05D_GLOC_IN2      ((PIN_PA05D_GLOC_IN2 << 16) | MUX_PA05D_GLOC_IN2)
#define GPIO_PA05D_GLOC_IN2      _UL(1 <<  5)
#define PIN_PA22D_GLOC_IN2             _L(22) /**< \brief GLOC signal: IN2 on PA22 mux D */
#define MUX_PA22D_GLOC_IN2              _L(3)
#define PINMUX_PA22D_GLOC_IN2      ((PIN_PA22D_GLOC_IN2 << 16) | MUX_PA22D_GLOC_IN2)
#define GPIO_PA22D_GLOC_IN2      _UL(1 << 22)
#define PIN_PA07D_GLOC_IN3              _L(7) /**< \brief GLOC signal: IN3 on PA07 mux D */
#define MUX_PA07D_GLOC_IN3              _L(3)
#define PINMUX_PA07D_GLOC_IN3      ((PIN_PA07D_GLOC_IN3 << 16) | MUX_PA07D_GLOC_IN3)
#define GPIO_PA07D_GLOC_IN3      _UL(1 <<  7)
#define PIN_PA23D_GLOC_IN3             _L(23) /**< \brief GLOC signal: IN3 on PA23 mux D */
#define MUX_PA23D_GLOC_IN3              _L(3)
#define PINMUX_PA23D_GLOC_IN3      ((PIN_PA23D_GLOC_IN3 << 16) | MUX_PA23D_GLOC_IN3)
#define GPIO_PA23D_GLOC_IN3      _UL(1 << 23)
#define PIN_PB06C_GLOC_IN4             _L(38) /**< \brief GLOC signal: IN4 on PB06 mux C */
#define MUX_PB06C_GLOC_IN4              _L(2)
#define PINMUX_PB06C_GLOC_IN4      ((PIN_PB06C_GLOC_IN4 << 16) | MUX_PB06C_GLOC_IN4)
#define GPIO_PB06C_GLOC_IN4      _UL(1 <<  6)
#define PIN_PB07C_GLOC_IN5             _L(39) /**< \brief GLOC signal: IN5 on PB07 mux C */
#define MUX_PB07C_GLOC_IN5              _L(2)
#define PINMUX_PB07C_GLOC_IN5      ((PIN_PB07C_GLOC_IN5 << 16) | MUX_PB07C_GLOC_IN5)
#define GPIO_PB07C_GLOC_IN5      _UL(1 <<  7)
#define PIN_PB08C_GLOC_IN6             _L(40) /**< \brief GLOC signal: IN6 on PB08 mux C */
#define MUX_PB08C_GLOC_IN6              _L(2)
#define PINMUX_PB08C_GLOC_IN6      ((PIN_PB08C_GLOC_IN6 << 16) | MUX_PB08C_GLOC_IN6)
#define GPIO_PB08C_GLOC_IN6      _UL(1 <<  8)
#define PIN_PB09C_GLOC_IN7             _L(41) /**< \brief GLOC signal: IN7 on PB09 mux C */
#define MUX_PB09C_GLOC_IN7              _L(2)
#define PINMUX_PB09C_GLOC_IN7      ((PIN_PB09C_GLOC_IN7 << 16) | MUX_PB09C_GLOC_IN7)
#define GPIO_PB09C_GLOC_IN7      _UL(1 <<  9)
#define PIN_PA08D_GLOC_OUT0             _L(8) /**< \brief GLOC signal: OUT0 on PA08 mux D */
#define MUX_PA08D_GLOC_OUT0             _L(3)
#define PINMUX_PA08D_GLOC_OUT0     ((PIN_PA08D_GLOC_OUT0 << 16) | MUX_PA08D_GLOC_OUT0)
#define GPIO_PA08D_GLOC_OUT0     _UL(1 <<  8)
#define PIN_PA24D_GLOC_OUT0            _L(24) /**< \brief GLOC signal: OUT0 on PA24 mux D */
#define MUX_PA24D_GLOC_OUT0             _L(3)
#define PINMUX_PA24D_GLOC_OUT0     ((PIN_PA24D_GLOC_OUT0 << 16) | MUX_PA24D_GLOC_OUT0)
#define GPIO_PA24D_GLOC_OUT0     _UL(1 << 24)
#define PIN_PB10C_GLOC_OUT1            _L(42) /**< \brief GLOC signal: OUT1 on PB10 mux C */
#define MUX_PB10C_GLOC_OUT1             _L(2)
#define PINMUX_PB10C_GLOC_OUT1     ((PIN_PB10C_GLOC_OUT1 << 16) | MUX_PB10C_GLOC_OUT1)
#define GPIO_PB10C_GLOC_OUT1     _UL(1 << 10)
/* ========== GPIO definition for ABDACB peripheral ========== */
#define PIN_PB02C_ABDACB_DAC0          _L(34) /**< \brief ABDACB signal: DAC0 on PB02 mux C */
#define MUX_PB02C_ABDACB_DAC0           _L(2)
#define PINMUX_PB02C_ABDACB_DAC0   ((PIN_PB02C_ABDACB_DAC0 << 16) | MUX_PB02C_ABDACB_DAC0)
#define GPIO_PB02C_ABDACB_DAC0   _UL(1 <<  2)
#define PIN_PA17B_ABDACB_DAC0          _L(17) /**< \brief ABDACB signal: DAC0 on PA17 mux B */
#define MUX_PA17B_ABDACB_DAC0           _L(1)
#define PINMUX_PA17B_ABDACB_DAC0   ((PIN_PA17B_ABDACB_DAC0 << 16) | MUX_PA17B_ABDACB_DAC0)
#define GPIO_PA17B_ABDACB_DAC0   _UL(1 << 17)
#define PIN_PB04C_ABDACB_DAC1          _L(36) /**< \brief ABDACB signal: DAC1 on PB04 mux C */
#define MUX_PB04C_ABDACB_DAC1           _L(2)
#define PINMUX_PB04C_ABDACB_DAC1   ((PIN_PB04C_ABDACB_DAC1 << 16) | MUX_PB04C_ABDACB_DAC1)
#define GPIO_PB04C_ABDACB_DAC1   _UL(1 <<  4)
#define PIN_PA19B_ABDACB_DAC1          _L(19) /**< \brief ABDACB signal: DAC1 on PA19 mux B */
#define MUX_PA19B_ABDACB_DAC1           _L(1)
#define PINMUX_PA19B_ABDACB_DAC1   ((PIN_PA19B_ABDACB_DAC1 << 16) | MUX_PA19B_ABDACB_DAC1)
#define GPIO_PA19B_ABDACB_DAC1   _UL(1 << 19)
#define PIN_PB03C_ABDACB_DACN0         _L(35) /**< \brief ABDACB signal: DACN0 on PB03 mux C */
#define MUX_PB03C_ABDACB_DACN0          _L(2)
#define PINMUX_PB03C_ABDACB_DACN0  ((PIN_PB03C_ABDACB_DACN0 << 16) | MUX_PB03C_ABDACB_DACN0)
#define GPIO_PB03C_ABDACB_DACN0  _UL(1 <<  3)
#define PIN_PA18B_ABDACB_DACN0         _L(18) /**< \brief ABDACB signal: DACN0 on PA18 mux B */
#define MUX_PA18B_ABDACB_DACN0          _L(1)
#define PINMUX_PA18B_ABDACB_DACN0  ((PIN_PA18B_ABDACB_DACN0 << 16) | MUX_PA18B_ABDACB_DACN0)
#define GPIO_PA18B_ABDACB_DACN0  _UL(1 << 18)
#define PIN_PB05C_ABDACB_DACN1         _L(37) /**< \brief ABDACB signal: DACN1 on PB05 mux C */
#define MUX_PB05C_ABDACB_DACN1          _L(2)
#define PINMUX_PB05C_ABDACB_DACN1  ((PIN_PB05C_ABDACB_DACN1 << 16) | MUX_PB05C_ABDACB_DACN1)
#define GPIO_PB05C_ABDACB_DACN1  _UL(1 <<  5)
#define PIN_PA20B_ABDACB_DACN1         _L(20) /**< \brief ABDACB signal: DACN1 on PA20 mux B */
#define MUX_PA20B_ABDACB_DACN1          _L(1)
#define PINMUX_PA20B_ABDACB_DACN1  ((PIN_PA20B_ABDACB_DACN1 << 16) | MUX_PA20B_ABDACB_DACN1)
#define GPIO_PA20B_ABDACB_DACN1  _UL(1 << 20)
/* ========== GPIO definition for PARC peripheral ========== */
#define PIN_PA17D_PARC_PCCK            _L(17) /**< \brief PARC signal: PCCK on PA17 mux D */
#define MUX_PA17D_PARC_PCCK             _L(3)
#define PINMUX_PA17D_PARC_PCCK     ((PIN_PA17D_PARC_PCCK << 16) | MUX_PA17D_PARC_PCCK)
#define GPIO_PA17D_PARC_PCCK     _UL(1 << 17)
#define PIN_PA09D_PARC_PCDATA0          _L(9) /**< \brief PARC signal: PCDATA0 on PA09 mux D */
#define MUX_PA09D_PARC_PCDATA0          _L(3)
#define PINMUX_PA09D_PARC_PCDATA0  ((PIN_PA09D_PARC_PCDATA0 << 16) | MUX_PA09D_PARC_PCDATA0)
#define GPIO_PA09D_PARC_PCDATA0  _UL(1 <<  9)
#define PIN_PA10D_PARC_PCDATA1         _L(10) /**< \brief PARC signal: PCDATA1 on PA10 mux D */
#define MUX_PA10D_PARC_PCDATA1          _L(3)
#define PINMUX_PA10D_PARC_PCDATA1  ((PIN_PA10D_PARC_PCDATA1 << 16) | MUX_PA10D_PARC_PCDATA1)
#define GPIO_PA10D_PARC_PCDATA1  _UL(1 << 10)
#define PIN_PA11D_PARC_PCDATA2         _L(11) /**< \brief PARC signal: PCDATA2 on PA11 mux D */
#define MUX_PA11D_PARC_PCDATA2          _L(3)
#define PINMUX_PA11D_PARC_PCDATA2  ((PIN_PA11D_PARC_PCDATA2 << 16) | MUX_PA11D_PARC_PCDATA2)
#define GPIO_PA11D_PARC_PCDATA2  _UL(1 << 11)
#define PIN_PA12D_PARC_PCDATA3         _L(12) /**< \brief PARC signal: PCDATA3 on PA12 mux D */
#define MUX_PA12D_PARC_PCDATA3          _L(3)
#define PINMUX_PA12D_PARC_PCDATA3  ((PIN_PA12D_PARC_PCDATA3 << 16) | MUX_PA12D_PARC_PCDATA3)
#define GPIO_PA12D_PARC_PCDATA3  _UL(1 << 12)
#define PIN_PA13D_PARC_PCDATA4         _L(13) /**< \brief PARC signal: PCDATA4 on PA13 mux D */
#define MUX_PA13D_PARC_PCDATA4          _L(3)
#define PINMUX_PA13D_PARC_PCDATA4  ((PIN_PA13D_PARC_PCDATA4 << 16) | MUX_PA13D_PARC_PCDATA4)
#define GPIO_PA13D_PARC_PCDATA4  _UL(1 << 13)
#define PIN_PA14D_PARC_PCDATA5         _L(14) /**< \brief PARC signal: PCDATA5 on PA14 mux D */
#define MUX_PA14D_PARC_PCDATA5          _L(3)
#define PINMUX_PA14D_PARC_PCDATA5  ((PIN_PA14D_PARC_PCDATA5 << 16) | MUX_PA14D_PARC_PCDATA5)
#define GPIO_PA14D_PARC_PCDATA5  _UL(1 << 14)
#define PIN_PA15D_PARC_PCDATA6         _L(15) /**< \brief PARC signal: PCDATA6 on PA15 mux D */
#define MUX_PA15D_PARC_PCDATA6          _L(3)
#define PINMUX_PA15D_PARC_PCDATA6  ((PIN_PA15D_PARC_PCDATA6 << 16) | MUX_PA15D_PARC_PCDATA6)
#define GPIO_PA15D_PARC_PCDATA6  _UL(1 << 15)
#define PIN_PA16D_PARC_PCDATA7         _L(16) /**< \brief PARC signal: PCDATA7 on PA16 mux D */
#define MUX_PA16D_PARC_PCDATA7          _L(3)
#define PINMUX_PA16D_PARC_PCDATA7  ((PIN_PA16D_PARC_PCDATA7 << 16) | MUX_PA16D_PARC_PCDATA7)
#define GPIO_PA16D_PARC_PCDATA7  _UL(1 << 16)
#define PIN_PA18D_PARC_PCEN1           _L(18) /**< \brief PARC signal: PCEN1 on PA18 mux D */
#define MUX_PA18D_PARC_PCEN1            _L(3)
#define PINMUX_PA18D_PARC_PCEN1    ((PIN_PA18D_PARC_PCEN1 << 16) | MUX_PA18D_PARC_PCEN1)
#define GPIO_PA18D_PARC_PCEN1    _UL(1 << 18)
#define PIN_PA19D_PARC_PCEN2           _L(19) /**< \brief PARC signal: PCEN2 on PA19 mux D */
#define MUX_PA19D_PARC_PCEN2            _L(3)
#define PINMUX_PA19D_PARC_PCEN2    ((PIN_PA19D_PARC_PCEN2 << 16) | MUX_PA19D_PARC_PCEN2)
#define GPIO_PA19D_PARC_PCEN2    _UL(1 << 19)
/* ========== GPIO definition for CATB peripheral ========== */
#define PIN_PA02G_CATB_DIS              _L(2) /**< \brief CATB signal: DIS on PA02 mux G */
#define MUX_PA02G_CATB_DIS              _L(6)
#define PINMUX_PA02G_CATB_DIS      ((PIN_PA02G_CATB_DIS << 16) | MUX_PA02G_CATB_DIS)
#define GPIO_PA02G_CATB_DIS      _UL(1 <<  2)
#define PIN_PA12G_CATB_DIS             _L(12) /**< \brief CATB signal: DIS on PA12 mux G */
#define MUX_PA12G_CATB_DIS              _L(6)
#define PINMUX_PA12G_CATB_DIS      ((PIN_PA12G_CATB_DIS << 16) | MUX_PA12G_CATB_DIS)
#define GPIO_PA12G_CATB_DIS      _UL(1 << 12)
#define PIN_PA23G_CATB_DIS             _L(23) /**< \brief CATB signal: DIS on PA23 mux G */
#define MUX_PA23G_CATB_DIS              _L(6)
#define PINMUX_PA23G_CATB_DIS      ((PIN_PA23G_CATB_DIS << 16) | MUX_PA23G_CATB_DIS)
#define GPIO_PA23G_CATB_DIS      _UL(1 << 23)
#define PIN_PB03G_CATB_DIS             _L(35) /**< \brief CATB signal: DIS on PB03 mux G */
#define MUX_PB03G_CATB_DIS              _L(6)
#define PINMUX_PB03G_CATB_DIS      ((PIN_PB03G_CATB_DIS << 16) | MUX_PB03G_CATB_DIS)
#define GPIO_PB03G_CATB_DIS      _UL(1 <<  3)
#define PIN_PB12G_CATB_DIS             _L(44) /**< \brief CATB signal: DIS on PB12 mux G */
#define MUX_PB12G_CATB_DIS              _L(6)
#define PINMUX_PB12G_CATB_DIS      ((PIN_PB12G_CATB_DIS << 16) | MUX_PB12G_CATB_DIS)
#define GPIO_PB12G_CATB_DIS      _UL(1 << 12)
#define PIN_PA04G_CATB_SENSE0           _L(4) /**< \brief CATB signal: SENSE0 on PA04 mux G */
#define MUX_PA04G_CATB_SENSE0           _L(6)
#define PINMUX_PA04G_CATB_SENSE0   ((PIN_PA04G_CATB_SENSE0 << 16) | MUX_PA04G_CATB_SENSE0)
#define GPIO_PA04G_CATB_SENSE0   _UL(1 <<  4)
#define PIN_PB13G_CATB_SENSE0          _L(45) /**< \brief CATB signal: SENSE0 on PB13 mux G */
#define MUX_PB13G_CATB_SENSE0           _L(6)
#define PINMUX_PB13G_CATB_SENSE0   ((PIN_PB13G_CATB_SENSE0 << 16) | MUX_PB13G_CATB_SENSE0)
#define GPIO_PB13G_CATB_SENSE0   _UL(1 << 13)
#define PIN_PA05G_CATB_SENSE1           _L(5) /**< \brief CATB signal: SENSE1 on PA05 mux G */
#define MUX_PA05G_CATB_SENSE1           _L(6)
#define PINMUX_PA05G_CATB_SENSE1   ((PIN_PA05G_CATB_SENSE1 << 16) | MUX_PA05G_CATB_SENSE1)
#define GPIO_PA05G_CATB_SENSE1   _UL(1 <<  5)
#define PIN_PB14G_CATB_SENSE1          _L(46) /**< \brief CATB signal: SENSE1 on PB14 mux G */
#define MUX_PB14G_CATB_SENSE1           _L(6)
#define PINMUX_PB14G_CATB_SENSE1   ((PIN_PB14G_CATB_SENSE1 << 16) | MUX_PB14G_CATB_SENSE1)
#define GPIO_PB14G_CATB_SENSE1   _UL(1 << 14)
#define PIN_PA06G_CATB_SENSE2           _L(6) /**< \brief CATB signal: SENSE2 on PA06 mux G */
#define MUX_PA06G_CATB_SENSE2           _L(6)
#define PINMUX_PA06G_CATB_SENSE2   ((PIN_PA06G_CATB_SENSE2 << 16) | MUX_PA06G_CATB_SENSE2)
#define GPIO_PA06G_CATB_SENSE2   _UL(1 <<  6)
#define PIN_PB15G_CATB_SENSE2          _L(47) /**< \brief CATB signal: SENSE2 on PB15 mux G */
#define MUX_PB15G_CATB_SENSE2           _L(6)
#define PINMUX_PB15G_CATB_SENSE2   ((PIN_PB15G_CATB_SENSE2 << 16) | MUX_PB15G_CATB_SENSE2)
#define GPIO_PB15G_CATB_SENSE2   _UL(1 << 15)
#define PIN_PA07G_CATB_SENSE3           _L(7) /**< \brief CATB signal: SENSE3 on PA07 mux G */
#define MUX_PA07G_CATB_SENSE3           _L(6)
#define PINMUX_PA07G_CATB_SENSE3   ((PIN_PA07G_CATB_SENSE3 << 16) | MUX_PA07G_CATB_SENSE3)
#define GPIO_PA07G_CATB_SENSE3   _UL(1 <<  7)
